Public Attributes | List of all members
API_HotspotType Struct Reference
Element Manager
Represents a hotspot. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_Elem_Head  | head
General element header.
 short  | pen
Pen attribute index.
 API_Coord  | pos
2D position of the hotspot.
 double  | height
Z coordinate of the hotpsot (this can come from a GDL script).
Detailed Description
Represents a hotspot.